Revit 2027 API
RebarSpliceTypeUtils Class
 Utility class for dealing with Rebar Splice Type operations. To find all Rebar Splice Types in the document can be done using FilteredElementCollector of category BuiltInCategory.OST_RebarSpliceType.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarSpliceTypeUtils
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class RebarSpliceTypeUtils
Public NotInheritable Class RebarSpliceTypeUtils
public ref class RebarSpliceTypeUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RebarSpliceTypeUtils = class end
The RebarSpliceTypeUtils type exposes the following members.
Methods
Name | Description
CreateRebarSpliceType |  Creates a Rebar Splice Type element.
GetAllRebarSpliceTypes |  Gets all the Rebar Splice Types elements from the document.
GetLapLengthMultiplier |  Gets the lap length multiplier value.
GetShiftOption |  Identifies the way bars are shifted in the splice relation.
GetStaggerLengthMultiplier |  Gets the stagger multiplier value.
SetLapLengthMultiplier |  Sets the lap length multiplier value.
SetShiftOption |  Sets the way bars are shifted in the splice relation.
SetStaggerLengthMultiplier |  Sets the lap length multiplier value.
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace